 /*Пользователь вводит с клавиатуры M чисел. Посчитайте, 
 сколько чисел больше 0 ввёл пользователь.
0, 7, 8, -2, -2 -> 2
1, -7, 567, 89, 223-> 4 */

/*Console.Write("Введите количество чисел для ввода ");
int n = Convert.ToInt32(Console.ReadLine()!);
int[] array = new int[n];

for(int i = 0; i < n; i++){
    Console.WriteLine($"Введите {i + 1} -e число: ");
    array[i] = Convert.ToInt32(Console.ReadLine()!);
}
int count = 0;
for(int i = 0; i < n; i++){
    if(array[i] > 0) count++;
}
Console.WriteLine($"Чисел больше 0 введенных пользователем равно: {count}"); */

/*Напишите программу, которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 
задаются пользователем. */

/*Console.Write("значение b1 = ");
double a = Convert.ToDouble(Console.ReadLine()!);
Console.Write("значение k1 = ");
double b = Convert.ToDouble(Console.ReadLine()!);
Console.Write("значение b2 = ");
double c = Convert.ToDouble(Console.ReadLine()!);
Console.Write("значение k2 = ");
double d = Convert.ToDouble(Console.ReadLine()!);

if(b != d){
double x = ((a - c) / (b - d));
double y = ((d * a) - (b * c) / (d - b));
Console.WriteLine($"Координаты точки пересечения прямых: ({Math.Round(x, 1)}; {Math.Round(y, 1)})");
}
else 
Console.WriteLine("Прямые параллельны");*/